[
  {
    "id": "1",
    "name": "Claude 3.5 Sonnet (Anthropic)",
    "description": "High-intelligence LLM API serving as the primary reasoning engine for the AutonomousCodingAgent. Excels in complex architectural planning, polyglot code synthesis, and deep technical problem-solving.",
    "url": "https://anthropic.com",
    "category": "AI Models"
  },
  {
    "id": "2",
    "name": "Gemini 1.5 Pro (Google)",
    "description": "Enterprise-scale multimodal model featuring an ultra-long context window. Used for large-scale codebase analysis, high-fidelity content generation, and multi-document reasoning.",
    "url": "https://deepmind.google/technologies/gemini/",
    "category": "AI Models"
  },
  {
    "id": "3",
    "name": "OpenAI Platform",
    "description": "State-of-the-art embedding models and GPT-4o integration for semantic retrieval, low-latency reasoning, and advanced natural language processing features across the ecosystem.",
    "url": "https://openai.com",
    "category": "AI Models"
  },
  {
    "id": "4",
    "name": "LangChain Framework",
    "description": "Advanced orchestration framework for building complex agentic workflows. Essential for managing tool-calling, stateful conversation memory, and recursive agent loops.",
    "url": "https://langchain.com",
    "category": "AI Models"
  },
  {
    "id": "5",
    "name": "Milvus & Pinecone",
    "description": "High-performance vector database solutions optimized for extreme-scale AI similarity search, enabling sub-millisecond contextual retrieval for knowledge-heavy applications.",
    "url": "https://milvus.io",
    "category": "AI Models"
  },
  {
    "id": "6",
    "name": "Docker Containerization",
    "description": "The foundational standard for modern deployment. Provides absolute consistency across development, staging, and production environments through immutable container images.",
    "url": "https://docker.com",
    "category": "DevOps"
  },
  {
    "id": "7",
    "name": "GitHub Actions CI/CD",
    "description": "Industrial-grade automation for testing, security auditing, and continuous deployment pipelines. Seamlessly integrated with our autonomous agentic workflows.",
    "url": "https://github.com/features/actions",
    "category": "DevOps"
  },
  {
    "id": "8",
    "name": "Kubernetes Orchestration",
    "description": "The gold standard for container orchestration, managing resilient, high-availability deployments with automated scaling and self-healing infrastructure.",
    "url": "https://kubernetes.io",
    "category": "DevOps"
  },
  {
    "id": "9",
    "name": "Terraform (IaC)",
    "description": "Immutable infrastructure-as-code platform for managing cloud ecosystems with repeatable, declarative configurations across multiple providers.",
    "url": "https://terraform.io",
    "category": "DevOps"
  },
  {
    "id": "10",
    "name": "Vercel Frontend Cloud",
    "description": "Global edge network optimized for Next.js applications, providing sub-second deployment times, real-time analytics, and advanced developer experience features.",
    "url": "https://vercel.com",
    "category": "DevOps"
  },
  {
    "id": "11",
    "name": "Next.js Architectural Docs",
    "description": "Deep-dive technical documentation for the Next.js App Router and Server Components architecture. Core reference for high-performance React engineering.",
    "url": "https://nextjs.org/docs",
    "category": "Learning"
  },
  {
    "id": "12",
    "name": "Tailwind CSS Reference",
    "description": "Comprehensive guide for utility-first styling patterns and responsive design best practices in modern, high-standard web development.",
    "url": "https://tailwindcss.com/docs",
    "category": "Learning"
  },
  {
    "id": "13",
    "name": "TypeScript Engineering Guide",
    "description": "Advanced documentation for type-safe software engineering, covering generic programming, utility types, and structural integrity in large-scale applications.",
    "url": "https://typescriptlang.org/docs/handbook",
    "category": "Learning"
  },
  {
    "id": "14",
    "name": "Deep Learning Specialization",
    "description": "The foundational educational pathway for mastering neural networks, computer vision, and the core principles of the modern AI revolution.",
    "url": "https://deeplearning.ai",
    "category": "Learning"
  },
  {
    "id": "15",
    "name": "FastAPI Technical Docs",
    "description": "Reference guide for building high-performance, asynchronous Python APIs with automatic type-validation and hyper-efficient execution models.",
    "url": "https://fastapi.tiangolo.com",
    "category": "Learning"
  },
  {
    "id": "16",
    "name": "Shadcn UI Architecture",
    "description": "Best-in-class component architectural patterns built with Radix UI and Tailwind CSS. The standard for accessible, aesthetically refined user interfaces.",
    "url": "https://ui.shadcn.com",
    "category": "Learning"
  }
]
